# -*- coding: utf-8 -*-
"""
Задание 4.7

Преобразовать MAC-адрес в строке mac в двоичную строку такого вида:
'101010101010101010111011101110111100110011001100'

Полученную новую строку вывести на стандартный поток вывода (stdout) с помощью print.

Ограничение: Все задания надо выполнять используя только пройденные темы.

Предупреждение: в разделе 4 тесты можно легко "обмануть" сделав нужный вывод,
без получения результатов из исходных данных с помощью Python.
Это не значит, что задание сделано правильно, просто на данном этапе сложно иначе
проверять результат.
"""

mac = "AAAA:BBBB:CCCC"

print(mac)

print('#'*40)

mac_list = mac.split(':')
mac_oct1 = bin(int(mac_list[0],16))
mac_oct2 = bin(int(mac_list[1],16))
mac_oct3 = bin(int(mac_list[2],16))

mac_common = mac_oct1[2::]+mac_oct2[2::]+mac_oct3[2::]
print (mac_common)
